In [2]:
from pathlib import Path
import os 
import matplotlib.pyplot as plt
import pandas as pd
from data_pipeline.kaggle import download_and_unzip_kaggle
from data_pipeline.data_loader import load_data
from data_pipeline.preprocess import preprocess_data

BASE_DIR = Path.cwd()  # Use os to get current working directory 


CSV_FILE = BASE_DIR / "Datasets" / "expense_data_1.csv" # path to database 
df = pd.read_csv(CSV_FILE) # place csv in data frame for EDA

ModuleNotFoundError: No module named 'matplotlib'

In [3]:
df.describe()
#df.loc[:, df.isnull().mean() <= 0.1]

       Subcategory           INR  Note.1        Amount     Account.1
count          0.0    277.000000     0.0    277.000000    277.000000
mean           NaN    410.750903     NaN    406.759134    406.759134
std            NaN   1065.756569     NaN   1065.158318   1065.158318
min            NaN      3.000000     NaN      3.000000      3.000000
25%            NaN     50.000000     NaN     50.000000     50.000000
50%            NaN    128.000000     NaN    125.000000    125.000000
75%            NaN    301.150000     NaN    300.000000    300.000000
max            NaN  10000.000000     NaN  10000.000000  10000.000000

In [6]:
# Can see ols subcategory and note.1 have many missing values

df.shape(df.columns)

TypeError: 'tuple' object is not callable

In [ ]:
#Dropped as redundant
df.drop(columns=["Subcategory", "Note.1"])

,Date,Account,Category,Note,INR,Income/Expense,Amount,Currency,Account.1
0,3/2/2022 10:11,CUB - online payment,Food,Brownie,50.0,Expense,50.0,INR,50.0
1,3/2/2022 10:11,CUB - online payment,Other,To lended people,300.0,Expense,300.0,INR,300.0
2,3/1/2022 19:50,CUB - online payment,Food,Dinner,78.0,Expense,78.0,INR,78.0
3,3/1/2022 18:56,CUB - online payment,Transportation,Metro,30.0,Expense,30.0,INR,30.0
4,3/1/2022 18:22,CUB - online payment,Food,Snacks,67.0,Expense,67.0,INR,67.0
...,...,...,...,...,...,...,...,...,...
272,11/22/2021 14:16,CUB - online payment,Food,Dinner,90.0,Expense,90.0,INR,90.0
273,11/22/2021 14:16,CUB - online payment,Food,Lunch with company,97.0,Expense,97.0,INR,97.0
274,11/21/2021 17:07,CUB - online payment,Transportation,Rapido,130.0,Expense,130.0,INR,130.0
275,11/21/2021 15:50,CUB - online payment,Food,Lunch,875.0,Expense,875.0,INR,875.0
276,11/21/2021 13:30,CUB - online payment,Other,Got from gobi,2000.0,Income,2000.0,INR,2000.0

In [1]:


plt.scatter(df.Amount, df.Account)
plt.xlabel("Amount")
plt.ylabel("Account")
plt.title("Scatter Plot of Amount vs Account")
plt.show()

NameError: name 'plt' is not defined